{"30":"0","31":"1","32":"2","34":"4","38":"8","53":"S","73":"s","78":"x","416":" 6","621":"12","623":"14","645":"27","647":"1X","660":"33","663":"36","665":"38","666":"2X","667":"1x","680":"44","681":"45","683":"47","685":"3X","686":"2x","2192":"→","187008":"45.5","273467":"Sale","1967086":"Email *","8449804":"Verification Required","23735199":"Overview","32583327":"If, at our request, you send certain specific submissions (for example contest entries) or without a request from us you send creative ideas, suggestions, proposals, plans, or other materials, whether online, by email, by postal mail, or otherwise (collectively, 'comments'), you agree that we may, at any time, without restriction, edit, copy, publish, distribute, translate and otherwise use in any medium any comments that you forward to us. We are and shall be under no obligation (1) to maintain any comments in confidence; (2) to pay compensation for any comments; or (3) to respond to any comments.","46628595":"model wearing size","48010856":"Privacy Policy ","57103602":"Afrikaa Johnson- shares with us that many industries have yet announced their \"first female.\"Therefore, there is so much work to be done.","59346429":"DO NOT TRACK","59737303":"As described above, we use your Personal Information to provide you with targeted advertisements or marketing communications we believe may be of interest to you. For more information about how targeted advertising works, you can visit the Network Advertising Initiative’s (“NAI”) educational page at http://www.networkadvertising.org/understanding-online-advertising/how-does-it-work.","61369063":"Blazers","66134559":"Account verification required. Please check your email to find your unique verification link.","75395549":"The Sovana Set is more than a look it’s an embrace of ambition, sophistication, and individuality. Created for the modern woman who commands presence everywhere she goes.","274f16":"Shop","3c2336d":"About","-569fd154":"Our Journey","-64104400":"Contact","24897f":"Menu","17c08":"bag","22ef33":"Item","-426d07ee":"Shipping ","58d99331":"calculated at checkout","4d3eb24":"Total","-7941186e":"Continue to Checkout","3d503d2b":"No items found.","-1c765d0d":"Product is not available in this quantity.","2268ff":"Home","-1d421114":"our journey","-3be6ddc4":"Categories","2f282257":"Archived Collections","-15e657cf":"Dropdown","-78547655":"Link 1","-78547654":"Link 2","-78547653":"Link 3","347ad498":"JOIN The MAILING LIST","5daf6597":"be the first to know about our latest collections, sales and updates!","5a0ea5a1":"Thank you! Your submission has been received!","-7c112e99":"Oops! Something went wrong while submitting the form.","6963a5d4":"Stockist","-6ca0ae38":"Search","3e2edd8":"Close","1fef40":"Cart","-5095d827":"the bag","43af7a0":"Items","-76f396dc":"Subtotal","-7c891b82":"Izayla","-3fd5f13b":"Sophistication","-3c46841b":"meets ambition ","-2af32b6f":"About Izayla","-726b3b06":"Shop With confidence","31c6b4e2":"Free Shipping","439048ba":"black woman owned business","-39ba48b1":"made in Los Angeles","-5e0677cd":"REVIEWS & TESTIMONIALS","-29019a46":"LOVEEE THE DRESS!!!!","-3c8bfcfc":"I bought this dress for an event and it fit me like a glove/ I got a lot of compliments!","-4d33f702":"I felt so pretty in it","-2ea4526b":"NICOLE IRISH","-1a0fe79d":"STYLISH AND SUSTAINABLE!","fc5ebcc":"I love Fumi the Label! Their clothing is not only stylish but also sustainable. The quality is amazing, and teel great knowing I'm supporting ethical fashion.","6278057f":"COMFORTABLE AND CHIC!","-22946b06":"Fumi the Label offers the perfect blend of comfort and style. I've never felt so effortlessly chic in their pieces. ","-792cf86c":"EXTENDED SIZES AVAILABLE","4d6ecd62":"black women owned","2ff4f1cf":"EXCHANGE policy","-5ae7feb3":"Follow us","-24cd514f":"on instagram","-5606d820":"@izayla.us →","3d84a99e":"join the Newsletter","1c14bceb":"Where sophistication and ","23f1751c":"ambition live every day","-3124c9a3":"#izaylawomen","-47761f27":"Newsletter","-1e76fa6e":"I’d like to sign up to the Izayla newsletter. My email won’t be shared with any third party companies.","62162b9":"legal","329660ca":"privacy policy","6afb94eb":"terms & conditions","33155f":"menu","-765033fc":"buyer guides","112f6":"Faq","29b16a1d":"size guide","5c9836b0":"exchanges","-37393ca8":"Assistance","38a73c7d":"company","585238d":"about","-21d2a000":"contact ","-64202ba3":"Company","-4ba2c44f":"follow","-6aaf5b06":"TikTok","1b907b2":"instagram","7dc227d1":"Follow","-75376994":"© Izayla 2025","1dc9451":"about izayla","6c76866":"Founded in 2017 in Los Angeles, Izayla is an advanced contemporary womenswear brand for the modern woman who radiates ambition and sophistication. Produced locally in small batches and crafted by artisans, each piece is designed with intention—empowering women to move with confidence, embrace sophistication, and embody ambition through elegance as they define their own path.","-2de78d89":"#Ourresponsibility","-653b1bab":"Womens","5754ec1b":"Empowerment","-63b8db13":"Representation","-6b2de0d3":"Integrity","5de899a3":"Empowering women","-6e42bcc4":"Giving back and giving women the confidence to conquer their goals through; resources, mentorship and grants. Izayla Foundation will be launching soon to advance women in their next steps to start their journey of entrepenrship.","7689bd9f":"Representation matters","53f23ebe":"Representation is significant to I'sha Dunston especially being a Black Woman in the Fashion Industry. She wants to inspire other Black Woman to step out and follow their dreams and not be afraid of the Fashion Industry.","72fd800":"USA Manufactured","a7e3c36":"Producing in the United States and keeping jobs in the United States was apart of the plan when I'sha started the brand Izayla. We take pride in domestic craftsmanship while ensuring ethical compensation for all of her freelance contractors.","4dae225c":"Search by name","3f315c41":"Something new is here!","-3628e6a2":"enter password for entry","-f5c4b5f":"Incorrect password. Please try again.","-21159850":"Something New Is Coming!","-40b08825":"Our latest collection is on the way... Sign up for release updates and upcoming news! ","-136074ad":"By submitting this form, you consent to receive informational (e.g., order updates) and/or marketing texts (e.g., cart reminders) from [company name] including texts sent by autodialer. Consent is not a condition of purchase. Msg & data rates may apply. Msg frequency varies. Unsubscribe at any time by replying STOP or clicking the unsubscribe link (where available). Privacy Policy & Terms.","645efc51":"About Us","c938":"404","-40b0787c":"Page Not Found","-2624ce29":"Access Denied","4617a544":"A site membership is required to view this page. Please ","-204ff442":"Sign up","103a7d":" or ","-7804285f":"Log in","2e":".","7f2581fc":"Introducing","22fb2b0f":"Afrikaa","de45887":"Johnson","-22cf39fe":"#IzaylaWomenInBusiness","585273cc":"Afrikka johnson","52d68dad":"The IZAYLA Women in Business” series featuring ","11cd0b0e":"@damn_afrikaa","4fbdec83":" Afrikaa Johnson. COO & Co founder of ","e1086df":"@ftagallery","3e6de458":". Her firm represents many up and coming and/or young talent and established brands. ","200d":"‍","3b452d8c":"Afikaa explains how women can support each other by simply; seeing one another & acknowledging each other ideas. Stay tuned throughout the month of March with us to see us feature 1 more woman in our “Izayla Women in Business Series” ✨ ","4837a719":"#IzaylaWomenInBusinessSeries","3c50af2c":"The Izayla Women Series","5e556b66":"\" There are still many industries that have yet to name it's first female... So there is still so much more work to be done. \"","1ba2cdb9":"- Afrikka Johnson","-56cd55c9":"What she wore","67e835d8":"What advice would you give to the next generation of female leaders?","1bcab7c7":"\"I would like to encourage the next generation of female leaders to keep pushing the limits.\"","d04caba":"Next Interview: ","126e219f":"Areial Lomack","33a77f01":"watch the interview","25ff54":"Play","58f18":"▶︎","6f418ef7":"Afrikaa Johnson- shares with us that many industries have yet announced their “first female..”Therefore, there is so much work to be done. ","665ee9e2":"#IzaylaWomeninBusiness","30aca076":"Afrikaa Johnson","-45ee07a2":"izayla","-6f3b9d7d":"- Afrikaa Johnson","23e94a31":"All Women →","-26a4fad7":"Shop All →","7560f7a0":"Areial","-78007ae1":"Lomack","5685adc0":"Areial Lomack - shares how becoming a mother has given her more drive & courage to go after what she wants at full force throttle.","5d6db272":"featuring Areial Lomack","4909357f":"Areial lomack","-26794d1c":"Introducing “The IZAYLA Women in Business” series featuring Areial Lomack, born & raised in Oakland, California who is the Owner & Founder of ","582e9a35":"@twelveam.co","5b2":". ","6e0c2d1":"Areial expresses how watches her mother raise 3 girls, working and having a side business side truly motivated her to being the mother she is today! Stay tuned throughout the week with us to learn more about ","-51bd0e42":"@areial.l","7d75":" + ","602ad792":" in our “Izayla Women in Business Series” ✨","45df1f45":"\"Becoming a mother didn't really change my aspirations. It just gave me more drive and courage to go after what i want to do full throttle.\"","19b902ec":"- Areial Lomack","-5fdeba02":"\"Don't take no for an answer and not to leave any crumbs at the table. ","-690e1413":"I have someone else depending on me so I have to take this life seriously\"","289a0e9a":"Gabrielle Layne","7604c93f":"\"Becoming a mother didn't really change my aspirations. It just gave me more drive and courage to go after what i want to do full throttle. \"","-7d56c51":"Ariel Tinsey","29e4a8bf":"Meet Ariel Tinsey - In her interview she shares with us that there is enough opportunity for us all and what is meant for you no one can take away!","-5260784b":"Introducing “The IZAYLA Women in Business” series featuring ","-3b77142a":"@stylemeariel","-5f4083aa":". Ariel is a Wardrobe Stylist & Costume Designer. She styles the top rated hottest artists & collaborates with designers to curate one of kind pieces for her clients. ","559a739a":"Ariel expresses that we meet different women of culture & women with different walks of life. Its important to share through their journey & creativity to able to story-tell through fashion and lifestyle. ","-447c9619":"\"If more women were aware of how powerful our softness, tenderness, intuitive spirits, we wouldn't define power with masculine traits.\"","7c87d4c2":"- Ariel Tinsey","3459ef0c":"\"Having a balanced life creates a mental space for more opportunities. Also remember to smile through it all\"","-a10e6b0":"Meet Ariel Tinsey - In her interview she shares with us that there is enough opportunity for us all and what is meant for you no one can take away! a true inspiration for us here at Izayla. ","1059a913":"Brittany","2942d377":"hampton","-2d86949a":"Meet Brittany Hampton, the versatile Art Director of @honorthegift, as she empowers women to step up and lead!","2d59114a":"brittany hampton","-10c5638e":"Introducing “The IZAYLA Women in Business” series featuring Brittany Hampton, a woman with all trades! Brittany Hampton is currently the Art Director of ","-7cde6e49":"@honorthegift","-5502e5a2":"Hampton expresses how women are next up to lead and are ready to lead! Stay tuned throughout the month of March with us to see us feature 2 more women in our “Izayla Women in Business Series” ✨ ","-5b5ddd17":"\"We can no longer have the urge to compete against one another when we have the ability to unite and conquer\"","-42517057":"- Bittany Hampton","4fe83376":"\"Women in leadership positions have the ability to walk into any room with grace. ","6c26b85e":"Have a perspective worth listening to and follow through with the power to back her up.","1366cdd":"- Brittany Hampton","5e55ed4a":"Brittany Hampton","6ee30d93":"Meet Brittany Hampton, the versatile Art Director of @honorthegift, as she empowers women to step up and lead! #IzaylaWomenInBusinessSeries","-5efe05d0":"\" It's important that we recognize that imposter syndrome is a myth. You are where you are because you belong there! \"","-1993ab06":"\"Women in leadership positions have the ability to walk into any room with grace. Have a perspective worth listening to and follow through with the power to back her up.\"","8556e9e":"contact us","-11c12b5":"For all customer service & general inquiries please contact us with the form below. One of our staff members will be in contact you within 24 hours.","3dc335ac":"Select a topic","2fbf9f26":"Size & Fitting","-687141b0":"Orders, Shipping & Returns","49cb423":"Press","1d957563":"Retailers","48f8ef0":"Other","572f221a":"None of these topics match your request? Please ","1f7af39a":"send an email to hello@izayla.us","-2d5c8f7c":"Continue to Checkout →","71bb9a1c":"Buy now","5bb19202":"Sold Out","45c925b7":"This collection is empty","-58822ff8":"Shop By Style:","2da1b15d":"Shop By Collection:","7d6db798":"Filter","657c0830":"Filter By Style","-476a0f2c":"Shop the Izayla brand by style. Currently our best selling items at saksfifth are the the ","-2965a586":"Teal Tie Front Jumpsuit ","4c6b3298":" and the ","-3335c3ef":"Tracie Pinstriped Shorts","7635fb4f":"This is some text inside of a div block.","8a3cc32":"Playsuits","-5e9d1088":"Jumpsuits","-2a8a82fb":"Dresses","675e4388":"Bottoms","27ddde":"Tops","35fe7b7f":"Filter By Collection","-c32ada":"Shop by our curated collections. ","67f1cd9b":"Lounge Wear 22","1147e50":"Resort 23","4a933754":"High Summer 23","-590fc6cd":"Items You May Like","-16a48308":"These are the most visited items in our current collection! ","58636a08":"Shop Collection","-3ef1235":"Next collection","7aaa2dac":"This product is out of stock.","-35d5067b":"shop /","-30f41d6d":"collection / ","-1a353919":"Available Colors","6f97d919":"Sorry, This item is Out of Stock","2f063519":"get notified when we restock","24eeab":"Name","-2b7010d0":"Email Address","6fc88e7d":"Secure payment","-59df7a31":"Exchange Policy","-36dd13db":"** This item is on Pre order **","10cc804":"Shipping Begins ","26e1649":"Oct 5th","-617e0d01":"Size Chart","152d63a":"need additional assistance ? ","-63a57329":"Message us about this product ","-7f5e5a7e":"Here →","-2c9ae77a":"Questions about ","3ff5b7c":"Email","-63dc6819":"Message","5a5ddf8":"close","-6af26dbe":"There is a problem with your form, please check your submission. ","-211c116b":"Extended Sizes ","-671d33a1":"Hey Izayla Women! Did you know that we use to offer our Signature Tie Front Jumpsuit in extended sizes? Unfortunately, we had to remove these sizes from our collection as not many women were purchasing them. Our findings turned out that creating extended sizes requires more fabric yardage than regular sizing, which can be quite costly.","-1113124e":"You may have also noticed that some brands charge more for their extended sizes, which is not fair. But here's the good news - we are now offering custom services for our Signature Tie Front Jumpsuit exclusively! That means you can get a custom jumpsuit in any size or color you desire. Regular size or Extended size! Essentially \"made to order\".","-5045e72a":"If you've been eyeing our jumpsuit but couldn't find your size, worry no more! Simply send your inquiry to our email at info@izayla.us and we'll be more than happy to assist you in creating the perfect jumpsuit just for you. Don't miss out on this opportunity to rock our fabulous design in your size!","-73907923":"In the future, we hope to have ability to design all our collections in extended sizes,","-45c5d971":"Shipping & Exchange","-3368b102":"Standard shipping is always free. If for any reason you are not completely satisfied with your purchase, you may exchange the item(s) by mail for credit or product replacement. To learn more about our exchange policy, see ","-3fee75de":"Details","-472f3cb7":"Additional Details","15adc947":"Material","-62fda848":"Size & Fit","-6c9661bd":"Numberic","3ec39d08":"Bust (in)","5974653c":"Waist (in)","-65d46d95":"Hip(in)","afb":"XS","5f0":"0 ","2e5a81b":"31.5 ","c21e":"24 ","c5fe":"35 ","2cfd013":"2 - 4","26ea71bb":"33 - 34.5","54a35a2e":"25.5 - 27","-437b78d3":"26.5 - 38","4d":"M","39a341fb":" 6 - 8","5e8e039b":"36 - 37.5","-73b91f1d":"28.5 - 30","-13061336":"39 - 41","4c":"L","73d1d855":"10 - 12","-69ce1bb0":"39 - 40.5","496315ce":"31.5 - 33","4588b1ce":"42.5 - 44","af4":"XL","67e":"42","17f7e8":"34.5","1ac2c20f":"16w - 18w","154b0b8f":"44.5 - 47","-7c743904":"40 - 42.5","7fb1dafc":"51 - 53.5","3fc026dd":"20w - 22w","1cb0ec05":"49.5 - 53","-750e45e4":"45 - 47.5","-78e831e4":"56 - 58.5","c275":"24w","18e0a6":"54.5","69b":"50","6bb":"61","528eaf35":"This item","-30ace2f6":"is best matched with→","396107a4":"view item→","43dfe09d":"material & Fabrication","-78dced94":"popular pieces","-fb58620":"Complimentary standard shipping, returns & gift wrap","-692102b6":"Close →","32deb3a9":"Please follow the size chart below for general size references found on all products. If you need further assistance please email us directly at ","3c8a91c":"info@izayla.us","32cba3e7":" and be sure to include the item you inquire about.","-697a3d7f":"Extended sizes available for playsuits and jumpsuits, email us at ","-1aca2e0c":" for all requests.","2d96216":"25.5 ","17ff6a":"36.5","2dabf33":"28.5 ","180aad":"39.5","18032b":"37.5","65d":"30","67d":"41","61f":"10","1864c5":"42.5","185d43":"40.5","171f6e":"16w ","2f51cb9":"44.5 ","c924":"40 ","cd04":"51 ","bf30":"18w","18dce5":"53.5","177d47":"20w ","2f76294":"49.5 ","6a1":"56","c237":"22w","69e":"53","18778a":"47.5","18efaa":"58.5","5d9d2587":"need assistance shopping? ","-79aa920b":"Message us about the","-53a61115":"Extended Sizes","56c94b0":"In the future, we hope to have ability to design all our collections in extended sizes, too!","-4e3cc4bc":"Shipping & Exchanges","-243192c":"Standard domestic shipping is always free. If for any reason you are not completely satisfied with your purchase, you may return the item(s) by mail for an exchange or credit. To learn more about our exchange policy, see ","3c9c5176":"Sorry, We are sold out of this size!","-4835f140":"frequently asked questions","-2bf5a970":"Exchanges","-8645c2c":"Made to Order","337d0270":"Domestic Shipping","524ecf00":"international shipping","8965cb1":"complementary tailoring","-384ec1ac":"care instructions","-78dd2273":"customer support","3865c515":"Can items be exchanged? ","7868b9f":"We only accept exchanges within 7 days with no signs of stains or scent. Please be mindful, we are ","-36409bec":"made to order","-5b3939da":", if we do not have the size you're looking to exchange we will have to make it for you. Therefore, garments will take 4-14 business days to produce. When returning for an exchange, we will always provide a return shipping postage via email.","-5fb4ecf8":"For any questions regarding  exchanges please contact us at info@izayla.us","-7ce10f79":"how long does made to order take? ","-6b95d6ac":"If your order isn't in stock to ship next day. Your order will be ","6e2d1e9a":"made to order.","5f84a8e9":"Please allow 4-14 business days to make your garment and 2 business days to ship. ","-403233b":"Check our instant buys for next day shipping for items that we currently have in stock.","5257cb0a":"Updates will be sent periodically to your inbox and noted in your account. ","-444a5187":"How long does shipping take?","-6333925f":"Shipping takes 2-3 business days from when your order is completed.","41e02ee":"Do you ship internationally? ","-2883cb14":"Yes, we do ship internationally with the cost of $40.00.","a8493d":"Shipments are sent by UPS and once your order is dispatched, you will receive a tracking number via email.","3e21f3c":"All shipping charges are non-refundable.","-430e7810":"IZAYLA is not responsible for customs charges in the case of international purchases. ","-629f4b82":"If you require more information on shipping, please email us at info@izayla.us","7ec7e6a8":"Do you offer complementary tailoring?","1c569245":"Yes, We offer complementary tailoring services to our Signature Tie Front Jumpsuit only. We immediately contact you after you have placed your order and offer customization to your inseam of your choosing. For further questions contact us at info@izayla.us","5ea0ba0e":"what are the care instructions for taking care of silk?","5ad10c40":"When buying silk from Izayla, please only dry clean to ensure the quality of you garment. Keep in mind, silk does wrinkle when wearing which is normal. Make sure to steam out your silk before wearing to have flawless look.","42e5fe47":"can we get in contact with customer service directly?","-71ae680d":"Yes, if you would prefer to call us instead of emailing to get someone directly on the phone to help you with your questions. Please call 1(424) 302-7903","658abda4":"Introducing ","-7c10e041":"Gabrielle","45ce63b":"Layne","57c72961":"The trailblazing owner of Strut Communications, breaking barriers and empowering women in the world of marketing.","31107e02":"#izaylawomeninbusiness","25c63f66":"“The IZAYLA Women in Business” series is proud to recognize Gabriella Layne. She is the owner Strut Communications, a marketing agency in Los Angeles, California. During her interview, she highlighted the pay gaps that women might encounter in the public relations industry, despite the prevalence of female leaders in the field.","-16230a25":"According to Gabriella, women possess all the crucial qualities that the best leaders embody, including empathy and teamwork. She recognizes the essential role that women play in this industry and acknowledges their prominence.Stay tuned throughout the month of March with us to see us feature 3 more women in our “Izayla Women in Business Series” ✨","553eaa5d":"\"As women, we have everything we need to be effective leaders; we are deeply analytical, resourceful, empathetic, solution-oriented, and team-oriented. Lean into these inherent qualities, stay away from ego, and you're golden!\"","-4ae71c5d":"- Gabriella Layne","3c661a9":"I'd say to not wait for that moment we're all hoping to come to let us know we're ready. ","-643f7e7f":"No one is ever ready. It's never inherently easy.","56e84c3d":"Jade Ikazaboh","1bbbda1c":"introducing","191593a0":"Meet Gabriella Layne, owner of Strut Communications in LA. In her interview, she sheds light on pay gaps for women in PR, emphasizing their leadership qualities and vital industry role.","-3f61ddfb":"\"As women, we have everything we need to be effective leaders; ","-70b7e837":"we are deeply analytical, resourceful, empathetic, solution-oriented, and team-oriented. ","7418e41":"Lean into these inherent qualities, stay away from ego, and you're golden!\"","-774e2f59":"- Gabrielle Layne","71766c4":"\"BECOMING A GREAT LEADER STARTS FROM STARTING. ","59677fef":"THE BEST WAY TO LEARN IS TO DO. ","-34374e42":"YOU HAVE EVERYTHING YOU NEED RIGHT NOW - AND WHAT YOU DON'T HAVE. YOU'LL GAIN ALONG THE WAY.\"","25ba":"►","-47dd21d0":"Meet Jade Ikazaboh, the epitome of empowerment, as she fearlessly owns and operates @etclosangeles","-1372b891":"ariel TINSEY","12b06f41":"Meet Ariel Tinsey - In her interview she shares with us that there is enough opportunity for us all and what is meant for you no one can take away! ","8e150b6":"afrikaa johnson","-5119c915":"Afrikaa Johnson - shares with us that many industries have yet announced their “first female..”Therefore, there is so much work to be done. ","56c411b6":"Gabriella layne","-652d8d70":"Meet Gabriella Layne, the trailblazing owner of Strut Communications, breaking barriers and empowering women in the world of marketing. ","-54a97b8b":"Discover Izayla","560c7fcd":"Find Izayla at the below Saks Fifth Avenue locations and Tutuh in Greensboro, North Carolina. ","6b90cd01":"Saks Fifth Avenue","2b9c69c1":"Beverly Hills ","4f1968":"9600 Wilshire Blvd","42dfda0d":"Beverly Hills, CA 90212","78b82a44":"Houston - Galleria","77287eb1":"5175 Westeimer Rd","6d898077":"Houston, TX 77056","24017a76":"Miami - Brickell","1a70032a":"81 SW 8th st","3da7b6c9":"Miami, FL 33130","680e3e5b":"Miami - Dadeland","-1a2171ef":"7687 N Kendall Dr","3da7b70d":"Miami, FL 33156","526ed28f":"New York","46f0be2f":"611 5th Ave","af4321f":"New York, NY 10022","4d6a7c6":"Tutuh","-43cb1aa9":"2800 Lawndale Drive Suite 108","63bbc13a":"Greensboro","-47ad5d54":"NC 27408","5a7a4771":"Find Izayla at the below Saks Fifth Avenue locations ","-36218be2":"and Tutuh in Greensboro, North Carolina. ","-685b517c":"www.sakesfifthavenue.com","4c79fc6":"TUTUH","231c18":"Jade","67db6d35":"Ikazaboh","-2257f579":"Introducing “The IZAYLA Women in Business” series featuring Jade Ikazaboh, a native of LA who owns and operates ","71af9373":"@etclosangeles","687fccf8":". Jade expresses her passion and admiration for public relations, which has always been her dream career. ","-78ae4702":"She empowers herself by continually nurturing her aspirations and witnessing them grow into fruition. Jade is a self-reliant woman who takes charge of her life, making her own decisions, and revels in the fruits of her hard work.","c7ff64a":"Stay tuned throughout the month of March with us to see us feature 4 more women in our “Izayla Women in Business Series” ✨ ","-4605b230":"\"It's important that we recognize that imposter syndrome is a myth. You are where you are because you belong there!\"","5e332d8a":"- Jade Ikazaboh","2977160a":"\"I would tell the next generation of female leaders to be confident in themselves and their abilities. ","-bc29e32":"Advocate for yourself and others. While also maintaining resilience in the face of adversity.\"","-7d150e11":"Meet Jade Ikazaboh, an LA native and owner of @etclosangeles, who's living her dream in the world of public relations. She embodies self-reliance and empowerment as she turns her aspirations into reality. Join us for the Izayla Women in Business Series to hear Jade's inspiring journey.","-5c917cae":"Jade Ikazaboh, a native of LA who owns and operates ","-614ee9b7":"If you are a registered user, please enter your email and password.","-48eb5f45":"Password * ","7c95c01d":"Don't have an account?","-204ff822":"Sign Up","-4ccc12f5":"We're having trouble logging you in. Please try again, or contact us if you continue to have problems.","6bfe9c32":"Password Reset Email Sent","-13a89bf":"If we found an account associated with that email address, we've sent a link to reset your password.","2bfd368c":"Reset Password","-7c28e64b":"There was an error resetting your password. Please try again, or contact us if you continue to have problems.","5610b662":"Search Results ","-2a51338d":"Go to page ↗","-657ea5a":"Sorry, No Results...","-3d3c5c82":"Account activated","-7498bb4e":"Your account was created successfully. You will be redirected shortly.","-7bf1dbc9":"If nothing happens, click here.","-755c0c0b":"Name *","-3c289ffb":"Password *","4867e34d":"By creating an account, I agree to this website's ","1f0b149":" and ","4f204da5":"terms of service","-3db302e8":"I consent to receive marketing emails.","-76cf8d8b":"Already have an account?","-78042c3f":"Log In","-191558ad":"There was an error signing you up. Please try again, or contact us if you continue to have problems.","c159":"2-4","-1c88f0cb":"33-34.5","-70dbf669":"25.5-28 ","-191058f6":"35.5-39","d061":"6-8","2c9008f":"10-12","b14":"Xl","568f6ff1":"14-16 ","56c7d0fc":"18-20 ","2d800ef":"22-24","-61799129":"legal policies","-3e157255":"Terms & Conditions","-25d6f720":"This website is operated by IZAYLA. Throughout the site, the terms “we”, “us” and “our” refer to IZAYLA. IZAYLA offers this website, including all information, tools and services available from this site to you, the user, conditioned upon your acceptance of all terms, conditions, policies and notices stated here.","-2eb81272":"By visiting our site and/ or purchasing something from us, you engage in our “Service” and agree to be bound by the following terms and conditions (“Terms of Service”, “Terms”), including those additional terms and conditions and policies referenced herein and/or available by hyperlink. These Terms of Service apply to all users of the site, including without limitation users who are browsers, vendors, customers, merchants, and/ or contributors of content.","7f796ff1":"Please read these Terms of Service carefully before accessing or using our website. By accessing or using any part of the site, you agree to be bound by these Terms of Service. If you do not agree to all the terms and conditions of this agreement, then you may not access the website or use any services. If these Terms of Service are considered an offer, acceptance is expressly limited to these Terms of Service.","-4f529c53":"Any new features or tools which are added to the current store shall also be subject to the Terms of Service. You can review the most current version of the Terms of Service at any time on this page. We reserve the right to update, change or replace any part of these Terms of Service by posting updates and/or changes to our website. It is your responsibility to check this page periodically for changes. Your continued use of or access to the website following the posting of any changes constitutes acceptance of those changes.","-449234e1":"Our store is hosted on Shopify Inc. They provide us with the online e-commerce platform that allows us to sell our products and services to you.","277ba218":"SECTION 1 - ONLINE STORE TERMS","5b823e0":"By agreeing to these Terms of Service, you represent that you are at least the age of majority in your state or province of residence, or that you are the age of majority in your state or province of residence and you have given us your consent to allow any of your minor dependents to use this site.","-37bf607a":"You may not use our products for any illegal or unauthorized purpose nor may you, in the use of the Service, violate any laws in your jurisdiction (including but not limited to copyright laws).","-7e4d92ec":"You must not transmit any worms or viruses or any code of a destructive nature.","-49c7e3a8":"A breach or violation of any of the Terms will result in an immediate termination of your Services.","-41bf8d34":"SECTION 2 - GENERAL CONDITIONS","4c57f155":"We reserve the right to refuse service to anyone for any reason at any time.","142bc079":"You understand that your content (not including credit card information), may be transferred unencrypted and involve (a) transmissions over various networks; and (b) changes to conform and adapt to technical requirements of connecting networks or devices. Credit card information is always encrypted during transfer over networks.","60404f07":"You agree not to reproduce, duplicate, copy, sell, resell or exploit any portion of the Service, use of the Service, or access to the Service or any contact on the website through which the service is provided, without express written permission by us.","-1e8f619f":"The headings used in this agreement are included for convenience only and will not limit or otherwise affect these Terms.","-24bc38cf":"SECTION 3 - ACCURACY, COMPLETENESS AND TIMELINESS OF INFORMATION","-5dde844f":"We are not responsible if information made available on this site is not accurate, complete or current. The material on this site is provided for general information only and should not be relied upon or used as the sole basis for making decisions without consulting primary, more accurate, more complete or more timely sources of information. Any reliance on the material on this site is at your own risk.","c474788":"This site may contain certain historical information. Historical information, necessarily, is not current and is provided for your reference only. We reserve the right to modify the contents of this site at any time, but we have no obligation to update any information on our site. You agree that it is your responsibility to monitor changes to our site.","-449d3ab1":"SECTION 4 - MODIFICATIONS TO THE SERVICE AND PRICES","-7ad0be28":"Prices for our products are subject to change without notice.","-75b11b7c":"We reserve the right at any time to modify or discontinue the Service (or any part or content thereof) without notice at any time.","-6705ed7d":"We shall not be liable to you or to any third-party for any modification, price change, suspension or discontinuance of the Service.","-64bc3f79":"SECTION 5 - PRODUCTS OR SERVICES (if applicable)","-43313962":"Certain products or services may be available exclusively online through the website. These products or services may have limited quantities and are subject to return or exchange only according to our Return Policy.","-102abb5a":"We have made every effort to display as accurately as possible the colors and images of our products that appear at the store. We cannot guarantee that your computer monitor's display of any color will be accurate.","-2f521c98":"We reserve the right, but are not obligated, to limit the sales of our products or Services to any person, geographic region or jurisdiction. We may exercise this right on a case-by-case basis. We reserve the right to limit the quantities of any products or services that we offer. All descriptions of products or product pricing are subject to change at anytime without notice, at the sole discretion of us. We reserve the right to discontinue any product at any time. Any offer for any product or service made on this site is void where prohibited.","2b89fade":"We do not warrant that the quality of any products, services, information, or other material purchased or obtained by you will meet your expectations, or that any errors in the Service will be corrected.","4f66c9d1":"SECTION 6 - ACCURACY OF BILLING AND ACCOUNT INFORMATION","-4c2f0ef9":"We reserve the right to refuse any order you place with us. We may, in our sole discretion, limit or cancel quantities purchased per person, per household or per order. These restrictions may include orders placed by or under the same customer account, the same credit card, and/or orders that use the same billing and/or shipping address. In the event that we make a change to or cancel an order, we may attempt to notify you by contacting the e-mail and/or billing address/phone number provided at the time the order was made. We reserve the right to limit or prohibit orders that, in our sole judgment, appear to be placed by dealers, resellers or distributors.","5b07440d":"You agree to provide current, complete and accurate purchase and account information for all purchases made at our store. You agree to promptly update your account and other information, including your email address and credit card numbers and expiration dates, so that we can complete your transactions and contact you as needed.","22cb6be0":"For more detail, please review our Returns Policy.","590d9b52":"SECTION 7 - OPTIONAL TOOLS","3124d862":"We may provide you with access to third-party tools over which we neither monitor nor have any control nor input.","1c32f8ce":"You acknowledge and agree that we provide access to such tools ”as is” and “as available” without any warranties, representations or conditions of any kind and without any endorsement. We shall have no liability whatsoever arising from or relating to your use of optional third-party tools.","6325b44":"Any use by you of optional tools offered through the site is entirely at your own risk and discretion and you should ensure that you are familiar with and approve of the terms on which tools are provided by the relevant third-party provider(s).","30824c3c":"We may also, in the future, offer new services and/or features through the website (including, the release of new tools and resources). Such new features and/or services shall also be subject to these Terms of Service.","-6efc71fd":"SECTION 8 - THIRD-PARTY LINKS","-1c6305b5":"Certain content, products and services available via our Service may include materials from third-parties.","-17989101":"Third-party links on this site may direct you to third-party websites that are not affiliated with us. We are not responsible for examining or evaluating the content or accuracy and we do not warrant and will not have any liability or responsibility for any third-party materials or websites, or for any other materials, products, or services of third-parties.","75c636e8":"We are not liable for any harm or damages related to the purchase or use of goods, services, resources, content, or any other transactions made in connection with any third-party websites. Please review carefully the third-party's policies and practices and make sure you understand them before you engage in any transaction. Complaints, claims, concerns, or questions regarding third-party products should be directed to the third-party.","-34435f45":"SECTION 9 - USER COMMENTS, FEEDBACK AND OTHER SUBMISSIONS","3fe49896":"We may, but have no obligation to, monitor, edit or remove content that we determine in our sole discretion are unlawful, offensive, threatening, libelous, defamatory, pornographic, obscene or otherwise objectionable or violates any party’s intellectual property or these Terms of Service.","-182f12f3":"You agree that your comments will not violate any right of any third-party, including copyright, trademark, privacy, personality or other personal or proprietary right. You further agree that your comments will not contain libelous or otherwise unlawful, abusive or obscene material, or contain any computer virus or other malware that could in any way affect the operation of the Service or any related website. You may not use a false e-mail address, pretend to be someone other than yourself, or otherwise mislead us or third-parties as to the origin of any comments. You are solely responsible for any comments you make and their accuracy. We take no responsibility and assume no liability for any comments posted by you or any third-party.","a4b6ac5":"SECTION 10 - PERSONAL INFORMATION","-554d1dac":"Your submission of personal information through the store is governed by our Privacy Policy. To view our Privacy Policy.","a387d80":"SECTION 11 - ERRORS, INACCURACIES AND OMISSIONS","1f4b7018":"Occasionally there may be information on our site or in the Service that contains typographical errors, inaccuracies or omissions that may relate to product descriptions, pricing, promotions, offers, product shipping charges, transit times and availability. We reserve the right to correct any errors, inaccuracies or omissions, and to change or update information or cancel orders if any information in the Service or on any related website is inaccurate at any time without prior notice (including after you have submitted your order).","-3fb1b2e6":"We undertake no obligation to update, amend or clarify information in the Service or on any related website, including without limitation, pricing information, except as required by law. No specified update or refresh date applied in the Service or on any related website, should be taken to indicate that all information in the Service or on any related website has been modified or updated.","-20e42fc9":"SECTION 12 - PROHIBITED USES","-7d67ded9":"In addition to other prohibitions as set forth in the Terms of Service, you are prohibited from using the site or its content:","-7a802a70":"(a) for any unlawful purpose; (b) to solicit others to perform or participate in any unlawful acts; (c) to violate any international, federal, provincial or state regulations, rules, laws, or local ordinances; (d) to infringe upon or violate our intellectual property rights or the intellectual property rights of others; (e) to harass, abuse, insult, harm, defame, slander, disparage, intimidate, or discriminate based on gender, sexual orientation, religion, ethnicity, race, age, national origin, or disability; (f) to submit false or misleading information;","329e56ba":"(g) to upload or transmit viruses or any other type of malicious code that will or may be used in any way that will affect the functionality or operation of the Service or of any related website, other websites, or the Internet; (h) to collect or track the personal information of others; (i) to spam, phish, pharm, pretext, spider, crawl, or scrape; (j) for any obscene or immoral purpose; or (k) to interfere with or circumvent the security features of the Service or any related website, other websites, or the Internet. We reserve the right to terminate your use of the Service or any related website for violating any of the prohibited uses.","-6d5f362f":"SECTION 13 - DISCLAIMER OF WARRANTIES; LIMITATION OF LIABILITY","42e21bec":"We do not guarantee, represent or warrant that your use of our service will be uninterrupted, timely, secure or error-free.","3105f66b":"We do not warrant that the results that may be obtained from the use of the service will be accurate or reliable.","-67d708f1":"You agree that from time to time we may remove the service for indefinite periods of time or cancel the service at any time, without notice to you.","647df6c6":"You expressly agree that your use of, or inability to use, the service is at your sole risk. The service and all products and services delivered to you through the service are (except as expressly stated by us) provided 'as is' and 'as available' for your use, without any representation, warranties or conditions of any kind, either express or implied, including all implied warranties or conditions of merchantability, merchantable quality, fitness for a particular purpose, durability, title, and non-infringement.","75d3aa51":"In no case shall IZAYLA, our directors, officers, employees, affiliates, agents, contractors, interns, suppliers, service providers or licensors be liable for any injury, loss, claim, or any direct, indirect, incidental, punitive, special, or consequential damages of any kind, including, without limitation lost profits, lost revenue, lost savings, loss of data, replacement costs, or any similar damages, whether based in contract, tort (including negligence), strict liability or otherwise, arising from your use of any of the service or any products procured using the service, or for any other claim related in any way to your use of the service or any product, including, but not limited to, any errors or omissions in any content, or any loss or damage of any kind incurred as a result of the use of the service or any content (or product) posted, transmitted, or otherwise made available via the service, even if advised of their possibility.","2d7bf037":"Because some states or jurisdictions do not allow the exclusion or the limitation of liability for consequential or incidental damages, in such states or jurisdictions, our liability shall be limited to the maximum extent permitted by law.","13ab7562":"SECTION 14 - INDEMNIFICATION","-1d2a07b3":"You agree to indemnify, defend and hold harmless IZAYLA and our parent, subsidiaries, affiliates, partners, officers, directors, agents, contractors, licensors, service providers, subcontractors, suppliers, interns and employees, harmless from any claim or demand, including reasonable attorneys’ fees, made by any third-party due to or arising out of your breach of these Terms of Service or the documents they incorporate by reference, or your violation of any law or the rights of a third-party.","59df55ed":"SECTION 15 - SEVERABILITY","-6c30cfae":"In the event that any provision of these Terms of Service is determined to be unlawful, void or unenforceable, such provision shall nonetheless be enforceable to the fullest extent permitted by applicable law, and the unenforceable portion shall be deemed to be severed from these Terms of Service, such determination shall not affect the validity and enforceability of any other remaining provisions.","-2864c74f":"SECTION 16 - TERMINATION","-af98d5f":"The obligations and liabilities of the parties incurred prior to the termination date shall survive the termination of this agreement for all purposes.","-3b0e466b":"These Terms of Service are effective unless and until terminated by either you or us. You may terminate these Terms of Service at any time by notifying us that you no longer wish to use our Services, or when you cease using our site.","362ae26":"If in our sole judgment you fail, or we suspect that you have failed, to comply with any term or provision of these Terms of Service, we also may terminate this agreement at any time without notice and you will remain liable for all amounts due up to and including the date of termination; and/or accordingly may deny you access to our Services (or any part thereof).","-60a49333":"SECTION 17 - ENTIRE AGREEMENT","39998b01":"The failure of us to exercise or enforce any right or provision of these Terms of Service shall not constitute a waiver of such right or provision.","-72188b1c":"These Terms of Service and any policies or operating rules posted by us on this site or in respect to The Service constitutes the entire agreement and understanding between you and us and govern your use of the Service, superseding any prior or contemporaneous agreements, communications and proposals, whether oral or written, between you and us (including, but not limited to, any prior versions of the Terms of Service).","-73278152":"Any ambiguities in the interpretation of these Terms of Service shall not be construed against the drafting party.","-4c40eec0":"SECTION 18 - GOVERNING LAW","-22962808":"These Terms of Service and any separate agreements whereby we provide you Services shall be governed by and construed in accordance with the laws of 1111 Wilshire Blvd ST 607, Los Angeles, CA, 90017, United States.","-4ee23bc3":"SECTION 19 - CHANGES TO TERMS OF SERVICE","64606c8f":"You can review the most current version of the Terms of Service at any time at this page.","452bdf80":"We reserve the right, at our sole discretion, to update, change or replace any part of these Terms of Service by posting updates and changes to our website. It is your responsibility to check our website periodically for changes. Your continued use of or access to our website or the Service following the posting of any changes to these Terms of Service constitutes acceptance of those changes.","45f41d12":"SECTION 20 - CONTACT INFORMATION","-7a35786c":"Questions about the Terms of Service should be sent to us at info@izayla.us.","-922d316":"Privacy policy","5306f694":"This Privacy Policy describes how your personal information is collected, used, and shared when you visit or make a purchase from izayla.us (the “Site”).","3c8e5f2c":"PERSONAL INFORMATION WE COLLECT","-47c18812":"When you visit the Site, we automatically collect certain information about your device, including information about your web browser, IP address, time zone, and some of the cookies that are installed on your device. Additionally, as you browse the Site, we collect information about the individual web pages or products that you view, what websites or search terms referred you to the Site, and information about how you interact with the Site. We refer to this automatically-collected information as “Device Information.”","43235a20":"We collect Device Information using the following technologies:","5f8cd085":"- “Cookies” are data files that are placed on your device or computer and often include an anonymous unique identifier. For more information about cookies, and how to disable cookies, visit http://www.allaboutcookies.org.","147ed069":"- “Log files” track actions occurring on the Site, and collect data including your IP address, browser type, Internet service provider, referring/exit pages, and date/time stamps.","7a4262ba":"- “Web beacons,” “tags,” and “pixels” are electronic files used to record information about how you browse the Site.","-6ab336b1":"Additionally when you make a purchase or attempt to make a purchase through the Site, we collect certain information from you, including your name, billing address, shipping address, payment information (including credit card numbers, Paypal and Apple Pay), email address, and phone number. We refer to this information as “Order Information.”","-765d19de":"OFFLINE DATA, PURCHASED MARKETING DATA/LISTS","-55d1524":"When we talk about “Personal Information” in this Privacy Policy, we are talking both about Device Information and Order Information.","-2f30d814":"HOW DO WE USE YOUR PERSONAL INFORMATION?","-58ea8433":"We use the Order Information that we collect generally to fulfill any orders placed through the Site (including processing your payment information, arranging for shipping, and providing you with invoices and/or order confirmations). Additionally, we use this Order Information to:","536efec9":"Communicate with you;","-676115fa":"Screen our orders for potential risk or fraud; and","65964b87":"When in line with the preferences you have shared with us, provide you with information or advertising relating to our products or services.","-6a48d2e9":"We use the Device Information that we collect to help us screen for potential risk and fraud (in particular, your IP address), and more generally to improve and optimize our Site (for example, by generating analytics about how our customers browse and interact with the Site, and to assess the success of our marketing and advertising campaigns).","4643276a":"We share your Personal Information with third parties to help us use your Personal Information, as described above. For example, we use Shopify to power our online store--you can read more about how Shopify uses your Personal Information here: https://www.shopify.com/legal/privacy. We also use Google Analytics to help us understand how our customers use the Site--you can read more about how Google uses your Personal Information here: https://www.google.com/intl/en/policies/privacy/. You can also opt-out of Google Analytics here: https://tools.google.com/dlpage/gaoptout.","41bed881":"Finally, we may also share your Personal Information to comply with applicable laws and regulations, to respond to a subpoena, search warrant or other lawful request for information we receive, or to otherwise protect our rights.","2e0dd7fc":"Please note that we do not alter our Site’s data collection and use practices when we see a Do Not Track signal from your browser.","-2c1fd99c":"YOUR RIGHTS","68b46e36":"If you are a European resident, you have the right to access personal information we hold about you and to ask that your personal information be corrected, updated, or deleted. If you would like to exercise this right, please contact us through the contact information below.","724aabc6":"Additionally, if you are a European resident we note that we are processing your information in order to fulfill contracts we might have with you (for example if you make an order through the Site), or otherwise to pursue our legitimate business interests listed above. Additionally, please note that your information will be transferred outside of Europe, including to Canada and the United States.","-40ef11f8":"DATA RETENTION","-567539da":"When you place an order through the Site, we will maintain your Order Information for our records unless and until you ask us to delete this information.","56d6eea3":"CHANGES","-eb3ab20":"We may update this privacy policy from time to time in order to reflect, for example, changes to our practices or for other operational, legal or regulatory reasons.","253fd2be":"CONTACT US","1027b9ed":"For more information about our privacy practices, if you have questions, or if you would like to make a complaint, please contact us by e-mail at info@izayla.us.","-16704faa":"Password updated","5284c470":"Your password was updated successfully. You were automatically logged in and can continue your session.","-27857705":"Go to Homepage","69ed5012":"Update Password","-2d35ed29":"Please enter your new password in the field below. Make sure you are not using your current password.","79707d5b":"New Password","-2da7dae4":"There was an error updating your password. Please try again, or contact us if you continue to have problems.","-585ec447":"My Account","4f13dfe8":"Password settings","2822d26c":"Reset password","6d17ba0b":"Your account was updated successfully.","13527f80":"There was an error updating your account. Please try again, or contact us if you continue to have problems.","-59ec052a":"Subscriptions","62c2aaf7":"No subscriptions","ba7e871":"About izayla","5195a682":"A timeline of becoming her","267d5466":"January 2017 ","-728a23f0":"Founded IZAYLA while studying Apparel Industry Management and Business Management at the Fashion Institute of Design & Merchandising Institute ","56a1f645":"October 2018","3c5c087f":"Debuted IZAYLA in Los Angeles at Art Hearts Fashion during Fashion Week.","-1e229820":"December 2018","-5fa83773":"Launched IZAYLA on ","-932c01e":"e-cmmece.","-7861457c":"February 2019","2dcc5075":"Showcased collection with Flying Solo in New York.","56a1f646":"October 2019","7c77ef5b":"Entered our first showroom, ECTERA, in Los Angeles and received our first celebrity placement on Blac Chyna.","204d6cc3":"August 2019","-196d4214":"Stocked at our first boutique in Miami, Circular by Pablo Delgado","137b970b":"September 2020","-1ff3d362":"Stocked at Elyse Walker in Pacific Palisades.","4606eb5a":"Awarded $50,000 in manufacturing support as one of 11 selected Black-owned brands by Be Resonant.","-3fcbf19":"Gabrielle Union wore our signature tie front jumpsuit on Good Morning America, later featured in PopSugar highlighting the look.","56a1f65c":"October 2020","3ce9cc9b":"Received the Buy From a Black Woman Trademark Grant to further support brand growth.","-78614565":"February 2021","-7a1573f0":"Selected as one of the Top 25 brands for the inaugural Raise Fashion Fashion Row Accelerator Program.","-731a9cf5":"November 2021","-438e86ec":"Stocked at Saks Fifth Avenue online and in select stores including Beverly Hills, New York, and Houston.","-78614564":"February 2022","397555fa":"Presented IZAYLA’s Spring/Summer ‘22 Collection in New York at The Gehry.","-412d1604":"June 2022","a173ba5":"Collaborated with the Emerge in Color + Beverly Center to showcase the brand alongside 20+ other Black-owned businesses.","3a6cb091":"Kelly Rowland wore IZAYLA’s signature jumpsuit to perform at the Coldplay concert—sparking viral attention.","137b970d":"September 2022","6d39a4fb":"Selected by the Black in Fashion Council to showcase IZAYLA at New York Fashion Week in partnership with Mailchimp.","55f96c0":"Featured in major publications including Forbes, Huffington Post, PopSugar, Jezebel, WWD, The Zoe Report, and Fashionista.","137b9710":"September 2025","22fbf6aa":"Your Cart Is Empty","efb":"xs","6d":"m","6c":"l","ef4":"xl","-61ac8c89":"Join Waitlist ","-5286fc08":"Lorem ipsum dolor sit amet, consectetur adipiscing elit. Suspendisse varius enim in eros elementum tristique. Duis cursus, mi quis viverra ornare, eros dolor interdum nulla, ut commodo diam libero vitae erat. Aenean faucibus nibh et justo cursus id rutrum lorem imperdiet. Nunc ut sem vitae risus tristique posuere.","6af22973":"Heading 1","6af22974":"Heading 2","6af22975":"Heading 3","6af22976":"Heading 4","6af22977":"Heading 5","6af22978":"Heading 6","36f186d6":"Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur.","40f76109":"Block quote","670f3891":"Ordered list","-7cdc0d7c":"Item 1","-7cdc0d7b":"Item 2","-7cdc0d7a":"Item 3","-27cb5e56":"Unordered list","-7cdc0d6c":"Item A","-7cdc0d6b":"Item B","-7cdc0d6a":"Item C","361eaeed":"Text link","4205e5c8":"Bold text","4abe799c":"Emphasis","1dea1fe6":"Superscript","-69de0115":"Subscript","-78958a2d":"** This item is sold out **"}